-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: cormisvietnam
-- ------------------------------------------------------
-- Server version	5.5.5-10.4.27-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `comments`
--

DROP TABLE IF EXISTS `comments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comments` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `eventsId` bigint(20) NOT NULL,
  `comments` text DEFAULT NULL,
  `dateCreated` datetime DEFAULT current_timestamp(),
  `status` varchar(45) DEFAULT NULL,
  `evaluationCriteriasId` bigint(20) DEFAULT 0,
  `userCreatorsId` bigint(20) NOT NULL DEFAULT 0,
  `counterpartId` bigint(20) DEFAULT 0 COMMENT '1 commments có thể chọn nhiều evaluationCriteriasId\n=> khi có nhiều => tách ra 1 comment chính và nhiều comments phụ (counterpartId)',
  `type` int(1) DEFAULT 0 COMMENT 'type:0  , comment thường\ntype:1 , lúc đăng ký',
  PRIMARY KEY (`id`),
  KEY `usersId` (`eventsId`),
  KEY `evaluationCriteriasId` (`evaluationCriteriasId`),
  KEY `counterpartId` (`counterpartId`)
) ENGINE=InnoDB AUTO_INCREMENT=600 DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comments`
--

LOCK TABLES `comments` WRITE;
/*!40000 ALTER TABLE `comments` DISABLE KEYS */;
INSERT INTO `comments` VALUES (12,1,'Khóa học java rất tốt cần cho thêm phụ đề','2023-01-03 00:00:00','1',12,521,0,0),(122,2,'Hôm nay trời đẹp nhất năm 2023','2023-01-03 10:00:38','1',13,519,0,0),(519,25,'Hôm nay trời đẹp nhất năm 2023','2023-01-02 00:00:00','1',13,520,0,0),(521,25,'Hôm nay trời đẹp nhất năm 2023 hieutrinh','2023-01-03 16:18:38','1',520,519,0,0),(522,12,'Hôm nay trời đẹp nhất năm 2023 hieutrinh','2023-01-04 10:59:21','1',12,519,0,0),(528,12,'Hôm nay trời đẹp nhất năm 2023 hieutrinh','2023-01-06 11:47:40','1',12,1,0,0),(529,12,NULL,'2023-01-06 11:47:40','1',520,1,528,0),(530,12,'Hôm nay trời đẹp nhất năm 2023 hieutrinh','2023-01-06 11:49:48','1',12,1,0,0),(531,12,NULL,'2023-01-06 11:49:48','1',520,1,530,0),(532,12,NULL,'2023-01-06 12:00:16','1',12,1,0,1),(533,12,NULL,'2023-01-06 12:00:16','1',520,1,532,0),(534,12,NULL,'2023-01-06 12:01:10','1',12,1,0,1),(535,12,NULL,'2023-01-06 12:01:10','1',520,1,534,1),(536,521,'','2023-01-06 12:07:36','1',519,1,0,0),(537,521,'','2023-01-06 12:10:13','1',23,1,0,1),(538,521,'Khá buồn nhé bạn hiền','2023-01-06 12:10:56','1',23,1,0,0),(539,521,'Chán lắm','2023-01-06 12:11:28','1',521,1,0,0),(540,521,'','2023-01-06 14:06:28','1',520,1,0,1),(541,521,'','2023-01-06 14:06:44','1',520,1,0,1),(542,521,'','2023-01-06 14:08:38','1',520,1,0,1),(543,521,'','2023-01-06 14:12:04','1',520,1,0,1),(544,521,'','2023-01-06 14:12:10','1',520,1,0,1),(545,521,'','2023-01-06 14:19:21','1',520,1,0,1),(546,521,'','2023-01-06 14:23:25','1',520,1,0,1),(547,521,'','2023-01-06 14:24:14','1',520,1,0,1),(548,521,'','2023-01-06 14:24:20','1',520,1,0,1),(549,521,'','2023-01-06 14:25:05','1',520,1,0,1),(550,521,'','2023-01-06 14:25:18','1',520,1,0,1),(551,521,'','2023-01-06 14:27:37','1',520,1,0,1),(552,521,'','2023-01-06 14:29:03','1',520,1,0,1),(553,521,'ok em','2023-01-06 15:47:42','1',521,1,0,0),(554,521,'hello','2023-01-06 15:49:38','1',520,1,0,0),(555,521,'ok','2023-01-06 15:58:33','1',520,1,0,0),(556,523,'ok em nhé','2023-01-06 16:21:11','1',0,1,0,0),(557,523,'Rất ý nghĩa đó các bạn trẻ','2023-01-06 16:21:35','1',0,1,0,0),(558,521,'','2023-01-06 17:09:02','1',520,1,0,1),(559,521,'ds','2023-01-09 11:09:09','1',0,1,0,0),(560,521,'d','2023-01-09 11:09:56','1',0,1,0,0),(561,521,'d','2023-01-09 11:11:19','1',0,1,0,0),(562,521,'d','2023-01-09 11:14:44','1',22,1,0,0),(563,525,'','2023-01-09 11:49:03','1',0,1,0,1),(564,525,'','2023-01-09 11:51:26','1',0,1,0,1),(565,525,'','2023-01-09 11:51:58','1',0,1,0,1),(566,525,'','2023-01-09 11:52:47','1',0,1,0,1),(567,525,'','2023-01-09 11:59:32','1',0,1,0,1),(568,525,'','2023-01-09 12:02:37','1',0,1,0,1),(569,525,'','2023-01-09 12:02:48','1',0,1,0,1),(570,525,'','2023-01-09 12:09:55','1',0,1,0,1),(571,525,'','2023-01-09 12:10:56','1',0,1,0,1),(572,525,'','2023-01-09 12:13:18','1',0,1,0,1),(573,525,'','2023-01-09 12:13:25','1',0,1,0,1),(574,525,'','2023-01-09 12:15:27','1',0,1,0,1),(575,525,'','2023-01-09 12:17:36','1',0,1,0,1),(576,525,'','2023-01-09 12:17:59','1',0,1,0,1),(577,525,'','2023-01-09 13:33:42','1',0,1,0,1),(578,521,'ổn mà ae ơi','2023-01-09 13:50:02','1',0,1,0,0),(579,521,'','2023-01-09 14:35:25','1',521,1,0,1),(580,521,'','2023-01-09 14:36:23','1',521,1,0,1),(581,521,'','2023-01-09 14:36:27','1',23,1,0,1),(582,521,'','2023-01-09 21:05:13','1',520,1,0,1),(583,521,'','2023-01-09 21:09:46','1',520,1,0,1),(584,521,'','2023-01-09 21:10:04','1',520,1,0,1),(585,521,'','2023-01-09 21:10:48','1',520,1,0,1),(586,521,'','2023-01-09 22:27:12','1',520,1,0,1),(587,521,'','2023-01-09 22:28:28','1',520,1,0,1),(588,521,'','2023-01-09 22:28:58','1',520,1,0,1),(589,521,'','2023-01-09 22:29:20','1',520,1,0,1),(590,521,'','2023-01-10 08:16:14','1',521,1,0,1),(591,521,'đf','2023-01-10 08:56:43','1',0,1,0,0),(592,525,'d','2023-01-10 09:04:42','1',0,1,0,0),(593,521,'d','2023-01-10 17:29:46','1',0,532,0,0),(594,521,'','2023-01-10 17:30:35','1',520,532,0,1),(595,1,'Boo','2023-01-10 18:17:57','1',524,1,0,0),(596,9,'','2023-01-11 16:13:31','1',520,1,0,1),(597,9,NULL,'2023-01-11 16:13:31','1',523,1,596,1),(598,3,'','2023-01-12 16:56:27','1',524,1,0,1),(599,3,NULL,'2023-01-12 16:56:27','1',521,1,598,1);
/*!40000 ALTER TABLE `comments` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-08-19 16:18:40
