-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: elearning
-- ------------------------------------------------------
-- Server version	5.5.5-10.4.27-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `courselevels`
--

DROP TABLE IF EXISTS `courselevels`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `courselevels` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `courseLevelsName` varchar(500) DEFAULT NULL COMMENT 'tên sản phẩm',
  `order` int(11) DEFAULT NULL,
  `userCreatorsId` bigint(20) NOT NULL COMMENT 'người tạo/Người bán',
  `courseGroupsId` bigint(20) NOT NULL COMMENT 'người tạo/Người bán',
  `status` int(11) DEFAULT NULL COMMENT 'trạng thái:\\\\nFalse: ẩn sản phẩm\\\\nTrue: hiển thị sản phẩm',
  `dateCreated` datetime DEFAULT current_timestamp() COMMENT 'ngày tạo',
  `dateUpdated` datetime DEFAULT current_timestamp(),
  `countExercises` int(11) DEFAULT 0,
  `countCourses` int(11) DEFAULT 0,
  `level` int(11) DEFAULT 1,
  PRIMARY KEY (`id`),
  KEY `courseGroupsId` (`courseGroupsId`) USING BTREE,
  KEY `courseLevels_status_IDX` (`status`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=87 DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='chương/ cấp bậc khóa học';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `courselevels`
--

LOCK TABLES `courselevels` WRITE;
/*!40000 ALTER TABLE `courselevels` DISABLE KEYS */;
INSERT INTO `courselevels` VALUES (1,'Giới thiệu',1,1,1,1,'2022-12-02 11:00:40','2022-12-07 10:16:43',3,2,1),(2,'Khái niệm kỹ thuật cần biết ',2,1,1,1,'2022-11-28 17:16:12','2022-12-27 13:59:11',1,9,1),(3,'Đại cương về các hệ thống thông tin',1,1,4,1,'2022-12-02 08:30:06','2022-12-02 16:00:09',1,1,1),(4,'Giới thiệu về con trỏ',1,1,3,1,'2022-12-02 15:02:10','2022-12-02 15:09:01',0,3,1),(5,'Hệ thống thông tin',2,1,4,1,'2022-12-02 16:00:22','2022-12-02 16:00:22',1,1,1),(8,'Khái niệm kỹ thuật cần biết  2',3,1,1,1,'2022-12-05 10:18:38','2022-12-05 10:18:38',0,0,1),(9,'chương 4',4,1,1,1,'2022-12-05 15:32:48','2022-12-05 15:32:48',0,0,1),(10,'Hệ thống DSS',3,1,4,1,'2022-12-05 23:56:29','2022-12-05 23:56:29',0,0,1),(11,'Bắt đầu',1,1,11,1,'2022-12-09 09:00:01','2022-12-09 09:00:01',1,8,1),(12,'Khái niệm kỹ thuật cần biết  3',5,1,1,1,'2022-12-09 09:42:42','2022-12-09 09:42:42',0,0,1),(13,'Chương 1',1,1,10,1,'2022-12-09 10:46:58','2022-12-09 10:46:58',0,1,1),(14,'Bắt đầu',1,1,12,1,'2022-12-15 16:01:36','2022-12-15 16:01:36',0,2,1),(15,'level 1',1,528,13,1,'2023-01-03 11:07:29','2023-01-03 16:31:40',0,2,1),(16,'Chương 1',1,527,14,1,'2023-01-03 14:53:27','2023-01-03 14:53:27',0,1,1),(17,'Chào người bạn mới ',1,533,16,1,'2023-01-04 09:32:04','2023-01-04 10:03:05',0,3,1),(18,'Adventure Peak',1,535,15,1,'2023-01-04 09:40:22','2023-01-04 09:40:22',0,2,1),(19,'Frozen Island',2,535,15,1,'2023-01-04 09:45:32','2023-01-04 09:45:32',0,2,1),(20,'Bài 1: Plains And Hill 1',1,536,18,1,'2023-01-04 09:47:34','2023-01-04 10:05:23',0,3,1),(21,'Khóa học Robot E20',1,534,17,1,'2023-01-04 09:48:42','2023-01-04 09:48:42',0,23,1),(22,'The Lost City',3,535,15,1,'2023-01-04 09:49:51','2023-01-04 09:49:51',0,3,1),(23,'Bài 2: Plains And Hill 2',2,536,18,1,'2023-01-04 09:50:22','2023-01-04 10:05:17',0,3,1),(24,'Crystal Crater',4,535,15,1,'2023-01-04 09:51:17','2023-01-04 09:51:17',0,2,1),(25,'Candy Town',5,535,15,1,'2023-01-04 09:52:46','2023-01-04 09:52:46',0,2,1),(26,'Birthday Party Buổi 1',2,533,16,1,'2023-01-04 09:57:39','2023-01-04 10:03:12',0,2,1),(27,'Sketch It',6,535,15,1,'2023-01-04 09:59:55','2023-01-04 09:59:55',0,1,1),(28,'The Milky Way',7,535,15,1,'2023-01-04 10:00:48','2023-01-04 10:00:48',0,1,1),(29,'Birthday Party Buổi 2',3,533,16,1,'2023-01-04 10:00:55','2023-01-04 10:03:21',0,3,1),(30,'Weebo\'s Manor',8,535,15,1,'2023-01-04 10:01:37','2023-01-04 10:01:37',0,2,1),(31,'Bài 3: Cruise Control',3,536,18,1,'2023-01-04 10:02:39','2023-01-04 10:05:06',0,2,1),(32,'Cyber World',9,535,15,1,'2023-01-04 10:03:38','2023-01-04 10:03:38',0,1,1),(33,'Birthday Party Buổi 3',4,533,16,1,'2023-01-04 10:03:45','2023-01-04 10:03:45',0,2,1),(34,'Arctic Lab',10,535,15,1,'2023-01-04 10:04:30','2023-01-04 10:04:30',0,2,1),(35,'Bài 4: Dangerous Curves 1',4,536,18,1,'2023-01-04 10:04:54','2023-01-04 10:05:01',0,3,1),(36,'Thời gian quý hơn vàng Buổi 1',5,533,16,1,'2023-01-04 10:05:10','2023-01-04 10:05:10',0,2,1),(37,'Thời gian quý hơn vàng Buổi 2',6,533,16,1,'2023-01-04 10:06:23','2023-01-04 10:06:23',0,2,1),(38,'Bài 5: Dangerous Curves 2',5,536,18,1,'2023-01-04 10:06:40','2023-01-04 10:06:40',0,4,1),(39,'Đường lên đỉnh Omlypia Buổi 1',7,533,16,1,'2023-01-04 10:08:03','2023-01-04 10:08:03',0,3,1),(40,'Khóa học Robotic Fun & Bot 3',1,535,19,1,'2023-01-04 10:08:44','2023-01-04 10:08:44',0,12,1),(41,'Bài 6: Dooding With Distance',6,536,18,1,'2023-01-04 10:09:00','2023-01-04 10:16:31',0,3,1),(42,'Đường lên đỉnh Omlypia Buổi 2',8,533,16,1,'2023-01-04 10:09:35','2023-01-04 10:09:35',0,3,1),(43,'Đường lên đỉnh Omlypia Buổi 3',9,533,16,1,'2023-01-04 10:11:26','2023-01-04 10:11:31',0,3,1),(44,'Bảo vệ đảo Buổi 1',10,533,16,1,'2023-01-04 10:12:34','2023-01-04 10:13:46',0,2,1),(45,'Bài 6: Dooding With Distance',15,536,18,0,'2023-01-04 10:13:21','2023-01-04 10:15:28',0,0,1),(46,'Bảo vệ đảo Buổi 2',11,533,16,1,'2023-01-04 10:14:06','2023-01-04 10:15:21',0,2,1),(47,'Bài 7: Touch Avoid Repeat',7,536,18,1,'2023-01-04 10:17:02','2023-01-04 10:17:02',0,3,1),(48,'Bài 8: Random Obstacles Ahead',8,536,18,1,'2023-01-04 10:19:13','2023-01-04 10:19:25',0,4,1),(49,'Bảo vệ đảo Buổi 3',12,533,16,1,'2023-01-04 10:19:41','2023-01-04 10:19:41',0,3,1),(50,'Bài 9: Radar mission',9,536,18,1,'2023-01-04 10:22:20','2023-01-04 10:22:20',0,2,1),(51,'Khóa học Robotic Fun & Bot 2',1,533,21,1,'2023-01-04 10:24:36','2023-01-04 10:24:36',0,12,1),(52,'Bài 10: Colorful code',10,536,18,1,'2023-01-04 10:24:39','2023-01-04 10:24:39',0,3,1),(53,'Khóa học Robotic E30',1,535,20,1,'2023-01-04 10:24:49','2023-01-04 10:24:49',0,12,1),(54,'Bài 11: Repeat Again',11,536,18,1,'2023-01-04 10:27:56','2023-01-04 10:27:56',0,3,1),(55,'Bài 12: Magnetic Manipulation',12,536,18,1,'2023-01-04 10:29:13','2023-01-04 10:29:13',0,3,1),(56,'Bài 13: Line Following Logic',13,536,18,1,'2023-01-04 10:30:30','2023-01-04 10:30:30',0,3,1),(57,'Bài 14: A Hard Block Life ',14,536,18,1,'2023-01-04 10:31:34','2023-01-04 10:31:34',0,2,1),(58,'Khóa học lập trình với robot Mbot',1,533,22,1,'2023-01-04 10:33:20','2023-01-04 10:33:20',0,11,1),(59,'Khóa học Robotic Science',1,536,23,1,'2023-01-04 10:37:42','2023-01-04 10:37:42',0,10,1),(60,'Khóa học Robot E10',1,534,24,1,'2023-01-04 10:44:10','2023-01-04 10:44:10',0,12,1),(61,'Khóa học Robotic Fun & Bot 1',1,533,25,1,'2023-01-04 10:53:14','2023-01-04 10:53:14',0,9,1),(62,'Bài 1. Giới thiệu khóa học',1,533,26,1,'2023-01-04 11:05:11','2023-01-04 11:06:16',0,1,1),(63,'Bài 2. Điều hướng cơ bản',2,533,26,1,'2023-01-04 11:05:25','2023-01-04 11:07:27',0,4,1),(64,'Bài 3. Cảm biến chạm',3,533,26,1,'2023-01-04 11:05:44','2023-01-04 11:07:49',0,2,1),(65,'Bài 4. Vòng lặp',4,533,26,1,'2023-01-04 11:08:56','2023-01-04 11:08:56',0,2,1),(66,'Bài 5. Cảm biến góc quay',5,533,26,1,'2023-01-04 11:09:27','2023-01-04 11:09:27',0,4,1),(67,'Bài 6. Ôn tập sáng tạo ',6,533,26,1,'2023-01-04 11:10:03','2023-01-04 11:10:03',0,1,1),(68,'Bài 7. Cảm biến siêu âm',7,533,26,1,'2023-01-04 11:10:34','2023-01-04 11:10:34',0,2,1),(69,'Bài 8. Cảm biến màu sắc',8,533,26,1,'2023-01-04 11:10:57','2023-01-04 11:10:57',0,2,1),(70,'Bài 9. Ôn tập sáng tạo',9,533,26,1,'2023-01-04 11:14:13','2023-01-05 09:44:26',0,2,1),(71,'Bài 10. Gặp gỡ cánh tay Robot',10,537,26,1,'2023-01-05 09:34:05','2023-01-05 09:46:56',0,2,1),(72,'Bài 11. Câu lệnh If-Else',11,537,26,1,'2023-01-05 09:34:20','2023-01-05 09:48:16',0,2,1),(73,'Bài 12. Tổng kết cuối khóa',12,537,26,1,'2023-01-05 09:34:38','2023-01-05 09:49:11',0,0,1),(74,'Khóa học Mtiny',1,537,27,1,'2023-01-05 11:47:07','2023-01-05 11:47:07',0,12,1),(75,'Chào người bạn mới',1,534,28,1,'2023-01-11 11:42:42','2023-01-11 11:42:42',0,3,1),(76,'Pico đến trường',2,534,28,1,'2023-01-11 11:44:32','2023-01-11 11:44:32',0,3,1),(77,'Cùng nhau bay lượn',3,534,28,1,'2023-01-11 11:46:02','2023-01-11 11:46:02',0,3,1),(78,'Mèo đuổi chuột',4,534,28,1,'2023-01-11 11:47:22','2023-01-11 11:47:22',0,2,1),(79,'Thám hiểm đại dương',5,534,28,1,'2023-01-11 11:48:22','2023-01-11 11:48:22',0,2,1),(80,'Bé làm toán',6,534,28,1,'2023-01-11 11:49:28','2023-01-11 11:49:28',0,2,1),(81,'Bé tập làm họa sĩ',7,534,28,1,'2023-01-11 11:50:35','2023-01-11 11:50:35',0,2,1),(82,'Mê cung',8,534,28,1,'2023-01-11 11:51:41','2023-01-11 11:51:41',0,2,1),(83,'Phiên dịch viên',9,534,28,1,'2023-01-11 11:54:06','2023-01-11 11:54:06',0,2,1),(84,'Thần đồng âm nhạc',10,534,28,1,'2023-01-11 11:55:08','2023-01-11 11:55:08',0,2,1),(85,'Cảm biến video',11,534,28,1,'2023-01-11 11:56:12','2023-01-11 11:56:12',0,3,1),(86,'Dự án cuối khóa',12,534,28,1,'2023-01-11 11:57:39','2023-01-11 11:57:39',0,1,1);
/*!40000 ALTER TABLE `courselevels` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-08-19 16:16:03
